app/controllers/admin_controller.rb

  def create
    @restaulantInfo = RestaulantInfo.new(restaulantInfo_params)
    @restaulantInfo.save
---
INSERT INTO "restaulant_infos" ("name", "img", "location", "address", "phone", "business_hours", "between_price_min", "between_price_max", "created_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def index
    @restaulantInfo = RestaulantInfo.all
---
SELECT "restaulant_infos".* FROM "restaulant_infos"

  def menuCreate
    @menu = Menu.new(params.require(:menu).permit(:name, :price, :key))
    @menu.save
---
INSERT INTO "menus" ("name", "price", "key", "created_at") VALUES (?, ?, ?, ?)  [["name", "테스트"], ["price", 1000], ["key", 1], ["created_at", "2017-06-28 09:35:46.057346"]]

  def showmenu
    key = params[:id]
    @menus = Menu.where(key: key)
---
SELECT "menus".* FROM "menus" WHERE "menus"."key" = ?  [["key", 1]]

  def createProduct
    @productInfo = ProductInfo.new(productInfo_params)
    @productInfo.save
---
INSERT INTO "product_infos" ("name", "img", "price", "rogoCU", "rogoGS", "rogoSeven", "created_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "바나나우유"], ["img", "__________.jpg"], ["price", 1000], ["rogoCU", "t"], ["rogoGS", "t"], ["rogoSeven", "f"], ["created_at", "2017-06-28 04:13:28.594741"]]

  def productlist
    @productInfo = ProductInfo.all
---
SELECT "product_infos".* FROM "product_infos"