app/controllers/main_controller.rb

SELECT  "restaulant_infos".* FROM "restaulant_infos" WHERE "restaulant_infos"."id" = ? LIMIT 1  [["id", nil]]
SELECT "menus".* FROM "menus" WHERE (key = 1)
---
  def r_detail
    @detailInfo = RestaulantInfo.find(params[:id]);
    @menus = Menu.where("key = %d" % [params[:id]]);

SELECT "product_infos".* FROM "product_infos" WHERE (name like '%밥%' and price between 1000 and 4000)
---
  def recive_p_data
    min_price = Integer(params[:minPrice])
    max_price = Integer(params[:maxPrice])
    product = "'%" + params[:productName] + "%'"

    @sendDatas = ProductInfo.where("name like %s and price between %d and %d" % [product,min_price,max_price])

SELECT "restaulant_infos".* FROM "restaulant_infos" WHERE (location like '%제주대%' and between_price_min >= 100 and between_price_max <= 200)
---
  def recive_r_data
    min_price = Integer(params[:minPrice])
    max_price = Integer(params[:maxPrice])
    location = "'%" + params[:location] + "%'"

    # @sendDatas = ActiveRecord::Base.connection.execute("select * from restaulant_infos where location like %s and between_price_min >= %d and between_price_max <= %d" % [location ,min_price,max_price])
    @sendDatas = RestaulantInfo.where("location like %s and between_price_min >= %d and between_price_max <= %d" % [location ,min_price,max_price])